# MechanicalEquipmentSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalEquipmentSet Class
Members See Also
---
A set of interrelated mechanical equipment in a MEP system that works together.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public class MechanicalEquipmentSet : Element
```

Visual Basic
---
```text
Public Class MechanicalEquipmentSet _
	Inherits Element
```

Visual C++
---
```text
public ref class MechanicalEquipmentSet : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Mechanical..::..MechanicalEquipmentSet
# See Also
MechanicalEquipmentSet Members
Autodesk.Revit.DB.Mechanical Namespace